Tekla.Structures.Geometry3d.FacetedBrep.#ctor(Tekla.Structures.Geometry3d.Vector[],System.Int32[][],System.Collections.Generic.IDictionary{System.Int32,System.Int32[][]},System.Collections.Generic.IList{Tekla.Structures.Geometry3d.IndirectPolymeshEdge})
Initializes a new instance of the Tekla.Structures.Geometry3d.FacetedBrep class.
@param vertices The vertices.
@param outerWires The outer wires.
@param innerWires The inner wires.
@param edges The edge information as indirect edges.